In [1]:
import numpy as np
import matplotlib.pyplot as pp
import pandas as pd
import seaborn

In [2]:
df1 = pd.read_csv("C:/Users/LIUYANFENG/Desktop/CovidDataDeathGlobal.csv", usecols = [0,1,323])
cols = list(df1)
cols.insert(0,cols.pop(cols.index('Country/Region')))
df2 = df1.loc[:,cols]
df3 = df2.values
df3 = list(map(list,zip(*df3)))
df3 = pd.DataFrame(df3)
arrt1 = df3.loc[0]

df3.columns = arrt1
df4 = df3.drop([0])
df4  = df4.reset_index()
df5 = df4.drop(labels='index',axis =1)
df5

,Afghanistan,Albania,Algeria,Andorra,Angola,Antigua and Barbuda,Argentina,Armenia,Australia,Australia,...,Uruguay,Uzbekistan,Vanuatu,Venezuela,Vietnam,West Bank and Gaza,Western Sahara,Yemen,Zambia,Zimbabwe
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Australian Capital Territory,New South Wales,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1874,905,2516,78,354,4,39770,2326,3,53,...,82,611,0,919,35,828,1,639,364,291

In [3]:
df6 = df5[['China']]
df7 = df6.drop([0])
df7 = df7.reset_index()
df8 = df7.drop(labels='index',axis =1)
Sum1 = df8.iloc[0,0:].sum()
df9 = pd.DataFrame([[Sum1]], columns = ['China'])
df9

   China
0   4746

In [4]:
df6 = df5[['Malaysia']]
df7 = df6.drop([0])
df7 = df7.reset_index()
df10 = df7.drop(labels='index',axis =1)
df10

0 Malaysia
0      382

In [5]:
df6 = df5[['US']]
df7 = df6.drop([0])
df7 = df7.reset_index()
df11 = df7.drop(labels='index',axis =1)
df11

0      US
0  282299

In [6]:
df6 = df5[['Canada']]
df7 = df6.drop([0])
df7 = df7.reset_index()
df8 = df7.drop(labels='index',axis =1)
Sum1 = df8.iloc[0,0:].sum()
df12 = pd.DataFrame([[Sum1]], columns = ['Canada'])
df12

   Canada
0   12688

In [7]:
df6 = df5[['United Kingdom']]
df7 = df6.drop([0])
df7 = df7.reset_index()
df8 = df7.drop(labels='index',axis =1)
Sum12 = df8.iloc[0,0:].sum()
df13 = pd.DataFrame([[Sum12]], columns = ['UK'])
df13

      UK
0  61342

# Death Number Comparision

In [9]:
df14 = pd.concat([df9, df10,df11,df12,df13],  axis=1)
df14

   China Malaysia      US  Canada     UK
0   4746      382  282299   12688  61342